Dokumentacija/Faza 5/app/Models/MajstorModel.php

SELECT `specijalnosti`.`Opis`
FROM `majstor`
JOIN `specijalnosti` ON `majstor`.`IdSpec` = `specijalnosti`.`IdSpec`
WHERE `majstor`.`IdMaj` = '28'
---
        public function getSpecialty($IdMaj) {
                $db = \Config\Database::connect();
                $builder = $db->table("majstor");
                $builder->select("specijalnosti.Opis");
                $builder->where("majstor.IdMaj", $IdMaj);
                $builder->join("specijalnosti", "majstor.IdSpec = specijalnosti.IdSpec");
                return $builder->get()->getResult();

SELECT `registrovani_korisnik`.`Ime`
FROM `majstor`
JOIN `registrovani_korisnik` ON `majstor`.`IdMaj` = `registrovani_korisnik`.`IdKor`
WHERE `majstor`.`IdMaj` = '28'
---
        public function getName($IdMaj) {
                $db = \Config\Database::connect();
                $builder = $db->table("majstor");
                $builder->select("registrovani_korisnik.Ime");
                $builder->where("majstor.IdMaj", $IdMaj);
                $builder->join("registrovani_korisnik", "majstor.IdMaj = registrovani_korisnik.IdKor");
                return $builder->get()->getResult();

SELECT `registrovani_korisnik`.`Prezime`
FROM `majstor`
JOIN `registrovani_korisnik` ON `majstor`.`IdMaj` = `registrovani_korisnik`.`IdKor`
WHERE `majstor`.`IdMaj` = '28'
---
        public function getSurname($IdMaj) {
                $db = \Config\Database::connect();
                $builder = $db->table("majstor");
                $builder->select("registrovani_korisnik.Prezime");
                $builder->where("majstor.IdMaj", $IdMaj);
                $builder->join("registrovani_korisnik", "majstor.IdMaj = registrovani_korisnik.IdKor");
                return $builder->get()->getResult();