Dokumentacija/Faza 5/app/Models/PorukaModel.php

    public function getAllReceivedMessagesGroupBy($IdTo){
        $poruke = $this->select('IdPos, COUNT(*) as BrojPoruka')
                    ->where("IdPri", $IdTo)
                    ->where("Status", 0)
                    ->groupBy('IdPos')
                    ->orderBy("DatumVreme", "ASC")
                    ->findAll();
---
SELECT `IdPos`, COUNT(*) as BrojPoruka
FROM `poruka`
WHERE `IdPri` = '16'
AND `Status` = 'pos'
GROUP BY `IdPos`
ORDER BY `DatumVreme` ASC

    public function getAllReceivedMessages($IdTo){
        $poruke = $this->select('IdPos')
                    ->where("IdPri", $IdTo)
                    ->where("Status", 0)
                    ->orderBy("DatumVreme", "ASC")
                    ->findAll();
---
SELECT `IdPos`
FROM `poruka`
WHERE `IdPri` = '33'
AND `Status` = 0
ORDER BY `DatumVreme` ASC

    public function setMessagesReceived($idFrom){
        $this->set(['Status' => 1])
        ->where('IdPri', $idFrom)
        ->where('Status !=', 2)
        ->update();
---
UPDATE `poruka` SET `Status` = 1
WHERE `IdPri` = '33'
AND `Status` != 2