Dokumentacija/Faza 5/app/Models/RecenzijaModel.php

SELECT *
FROM `recenzija`
WHERE `recenzija`.`IdKli` = '47'
AND `recenzija`.`IdMaj` = '28'
---
    public function isAlreadyReviewed($userId, $handymanId) {
        $db = \Config\Database::connect();
        $builder = $db->table("recenzija");
        if ($builder->select("*")
            ->where("recenzija.IdKli", $userId)
            ->where("recenzija.IdMaj", $handymanId)->get()->getNumRows() > 0) {

SELECT *
FROM `recenzija`
JOIN `registrovani_korisnik` ON `recenzija`.`IdKli` = `registrovani_korisnik`.`IdKor`
JOIN `grad` ON `registrovani_korisnik`.`IdGra` = `grad`.`IdGra`
JOIN `telefon` ON `registrovani_korisnik`.`IdKor` = `telefon`.`IdKor`
WHERE `recenzija`.`IdMaj` = '29'
---
    public function getReviews($handymanId) {
        $db = \Config\Database::connect();
        $builder = $db->table("recenzija");
        return $builder
        ->select("*")
        ->where("recenzija.IdMaj", $handymanId)
        ->join("registrovani_korisnik", "recenzija.IdKli = registrovani_korisnik.IdKor")
        ->join("grad", "registrovani_korisnik.IdGra = grad.IdGra")
        ->join("telefon", "registrovani_korisnik.IdKor = telefon.IdKor")
        ->get()->getResult();