Dokumentacija/Faza 5/app/Controllers/BaseController.php

    public function prikazProfilaMajstora($name, $surname, $specialty, $city, $phone, $email, $id) {
        $regModel = new RegistrovaniKorisnikModel();
        $slikaModel = new SlikaModel();
        $idSlike = $regModel->where("IdKor", $id)->findAll();
        $idSlike = $idSlike[0]->IdSli;
        $path = $slikaModel->where("IdSli", $idSlike)->findAll();
---
SELECT *
FROM `registrovani_korisnik`
WHERE `IdKor` = '33'
SELECT *
FROM `slika`
WHERE `IdSli` = '4'